## apply
mother_columns = list(pck_1462['세부분류사이즈'].unique())
mother_columns.insert(0, '주문자ID')
mother_df = pd.DataFrame(columns=mother_columns)

for customer_id in tqdm(list(pck_1462['주문자ID'].unique())):
    ex = Customer(pck, customer_id)
    baby_df = ex.daily_demand(yyyymmdd = '20190501',month = 5)
    mother_df = pd.concat([mother_df, baby_df])

# column 순서 이쁘게 정리하기
mother_df = mother_df[[ '주문자ID','감자탕용기_2200ml', '감자탕용기_2700ml', '감자탕용기_3200ml', '고강도미니탕용기_미니', '고무장갑', '군만두용기_1칸', '냄비_2750ml', '냄비뚜껑_大', '냉면용기_中', '냉면용기_大', '다용도컵_150ml', '다용도컵_165ml', '다용도컵_200ml', '다용도컵_250ml', '다용도컵_270ml', '다용도컵_300ml', '다용도컵_370ml', '다용도컵_400ml', '다용도컵_50ml', '다용도컵_600ml', '다용도컵_70ml', '다용도컵_80ml', '단무지', '도시락용기(돈까스)_5칸', '도시락용기(돈까스)_中', '도시락용기_4칸 A', '도시락용기_4칸 B', '도시락용기_5칸', '도시락용기_6칸 02', '도시락용기_6칸 L1', '도시락용기_7칸', '도시락용기_8칸', '랩칼', '미니탕용기_미니', '반찬용기_104_1칸', '반찬용기_105_1칸', '반찬용기_201_1칸', '반찬용기_202-2_2칸', '반찬용기_202_1칸', '반찬용기_203_1칸', '반찬용기_204_1칸', '반찬용기_211_1칸', '반찬용기_D-363', '반찬용기_D-364_4칸', '반찬용기_D-365_5칸', '비닐봉투(맛난거)_中', '비닐봉투(맛난거)_大', '비닐봉투(맛난거)_小', '비닐봉투(맛난거)_특大', '비닐봉투(무지)_中', '비닐봉투(무지)_大', '비닐봉투(무지)_小', '비닐봉투(무지)_특大', '비닐봉투(배달중)_中',
 '비닐봉투(배달중)_大', '비닐봉투(배달중)_小', '비닐봉투(배달중)_특大', '사각찬용기_4칸', '샐러드_1칸(550ml)', '샐러드_3칸(150ml)', '샐러드_4칸(100ml)', '수세미', '실링기계', '실링용기_1000ml', '실링용기_1150ml', '실링용기_1350ml', '실링용기_1500ml', '실링용기_2000ml', '실링용기_200ml', '실링용기_2200ml', '실링용기_230ml', '실링용기_3-5A', '실링용기_400ml', '실링용기_500ml', '실링용기_5칸', '실링용기_600ml', '실링용기_650ml', '실링용기_700ml', '실링용기_84-2A', '실링용기_900ml', '실링필름_150mm x 200 m', '실링필름_160mm x 200m', '실링필름_190mm x 200m', '실링필름_200mm x 200m', '실링필름_245mm  x 200m', '아이스컵 뚜껑_돔형_구멍', '아이스컵 뚜껑_돔형_노구멍', '아이스컵 뚜껑_평형_민자형_십자구멍', '아이스컵_12ounce', '아이스컵_14ounce', '아이스컵_16ounce', '아이스컵_24ounce', '아이스컵_돔형_구멍', '우동용기_中', '우동용기_大', '우동용기_특大', '원형용기_150ml', '원형용기_350ml', '원형용기_450ml', '원형용기_470ml', '원형용기_大', '원형접시_大', '원형접시_小', '원형접시_미니', '위생랩_2호', '위생롤백_2호', '위생롤백_5호', '위생장갑', '일회용 숟가락', '일회용 젓가락_198mm', '일회용 포크_160mm', '종이호일_1호', '종이호일_2호',
 '죽용기_1050ml', '죽용기_1150ml', '죽용기_400ml', '죽용기_550ml', '죽용기_750ml', '죽용기_920ml', '중식소스용기', '중화면용기 뚜껑', '중화면용기_中', '중화면용기_大', '중화면용기_小', '지퍼백_M', '짬짜면_2칸', '찜용기(사각)_2000ml', '찜용기(사각)_2500ml', '찜용기(사각)_3200ml', '찜용기(원)_2500ml', '찜용기(원)_3500ml', '찜용기(원)_4000ml', '찜용기(원)_4500ml', '찜용기(타원)_1800ml', '찜용기(타원)_2500ml', '찜용기(타원)_3000ml', '찬용기_250ml', '찬용기_350ml', '찬용기_450ml', '타원접시', '탕용기_195_大', '탕용기_195_小', '탕용기_210_大', '탕용기_210_小', '탕용기_225_1800ml', '탕용기_225_2400ml', '탕용기_225_3000ml', '탕용기_240_5000ml', '탕용기_270_6500ml', '행주']]

mother_df = mother_df.fillna(0) 

mother_df